OpenNuvoton/MS51BSP_NuEclipse/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_Define_MS51_32K_SDCC.h
  /*------- -------- Pin interrupt channel 5 PIT5 Enable------------------------ */
#define    ENABLE_PIT5_P00_LOWLEVEL          SFRS=2;PIPS5=0x00;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P01_LOWLEVEL          SFRS=2;PIPS5=0x01;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P02_LOWLEVEL          SFRS=2;PIPS5=0x02;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P03_LOWLEVEL          SFRS=2;PIPS5=0x03;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P04_LOWLEVEL          SFRS=2;PIPS5=0x04;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P05_LOWLEVEL          SFRS=2;PIPS5=0x05;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P06_LOWLEVEL          SFRS=2;PIPS5=0x06;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P07_LOWLEVEL          SFRS=2;PIPS5=0x07;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P10_LOWLEVEL          SFRS=2;PIPS5=0x10;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P11_LOWLEVEL          SFRS=2;PIPS5=0x11;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P12_LOWLEVEL          SFRS=2;PIPS5=0x12;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P13_LOWLEVEL          SFRS=2;PIPS5=0x13;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P14_LOWLEVEL          SFRS=2;PIPS5=0x14;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P15_LOWLEVEL          SFRS=2;PIPS5=0x15;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P16_LOWLEVEL          SFRS=2;PIPS5=0x16;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P17_LOWLEVEL          SFRS=2;PIPS5=0x17;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P20_LOWLEVEL          SFRS=2;PIPS5=0x20;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P21_LOWLEVEL          SFRS=2;PIPS5=0x21;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P22_LOWLEVEL          SFRS=2;PIPS5=0x22;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P23_LOWLEVEL          SFRS=2;PIPS5=0x23;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P24_LOWLEVEL          SFRS=2;PIPS5=0x24;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P25_LOWLEVEL          SFRS=2;PIPS5=0x25;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P30_LOWLEVEL          SFRS=2;PIPS5=0x30;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P31_LOWLEVEL          SFRS=2;PIPS5=0x31;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P32_LOWLEVEL          SFRS=2;PIPS5=0x32;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P33_LOWLEVEL          SFRS=2;PIPS5=0x33;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P34_LOWLEVEL          SFRS=2;PIPS5=0x34;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P35_LOWLEVEL          SFRS=2;PIPS5=0x35;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P36_LOWLEVEL          SFRS=2;PIPS5=0x36;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
#define    ENABLE_PIT5_P37_LOWLEVEL          SFRS=2;PIPS5=0x37;SFRS=0;PICON&=CLR_BIT5;PINEN|=SET_BIT5;PIPEN&=CLR_BIT5
           
#define    ENABLE_PIT5_P00_HIGHLEVEL         SFRS=2;PIPS5=0x00;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P01_HIGHLEVEL         SFRS=2;PIPS5=0x01;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P02_HIGHLEVEL         SFRS=2;PIPS5=0x02;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P03_HIGHLEVEL         SFRS=2;PIPS5=0x03;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P04_HIGHLEVEL         SFRS=2;PIPS5=0x04;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P05_HIGHLEVEL         SFRS=2;PIPS5=0x05;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P06_HIGHLEVEL         SFRS=2;PIPS5=0x06;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P07_HIGHLEVEL         SFRS=2;PIPS5=0x07;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P10_HIGHLEVEL         SFRS=2;PIPS5=0x10;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P11_HIGHLEVEL         SFRS=2;PIPS5=0x11;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P12_HIGHLEVEL         SFRS=2;PIPS5=0x12;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P13_HIGHLEVEL         SFRS=2;PIPS5=0x13;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P14_HIGHLEVEL         SFRS=2;PIPS5=0x14;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P15_HIGHLEVEL         SFRS=2;PIPS5=0x15;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P16_HIGHLEVEL         SFRS=2;PIPS5=0x16;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P17_HIGHLEVEL         SFRS=2;PIPS5=0x17;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P20_HIGHLEVEL         SFRS=2;PIPS5=0x20;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P21_HIGHLEVEL         SFRS=2;PIPS5=0x21;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P22_HIGHLEVEL         SFRS=2;PIPS5=0x22;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P23_HIGHLEVEL         SFRS=2;PIPS5=0x23;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P24_HIGHLEVEL         SFRS=2;PIPS5=0x24;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P25_HIGHLEVEL         SFRS=2;PIPS5=0x25;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P30_HIGHLEVEL         SFRS=2;PIPS5=0x30;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P31_HIGHLEVEL         SFRS=2;PIPS5=0x31;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P32_HIGHLEVEL         SFRS=2;PIPS5=0x32;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P33_HIGHLEVEL         SFRS=2;PIPS5=0x33;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P34_HIGHLEVEL         SFRS=2;PIPS5=0x34;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P35_HIGHLEVEL         SFRS=2;PIPS5=0x35;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P36_HIGHLEVEL         SFRS=2;PIPS5=0x36;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
#define    ENABLE_PIT5_P37_HIGHLEVEL         SFRS=2;PIPS5=0x37;SFRS=0;PICON&=CLR_BIT5;PINEN&=CLR_BIT5;PIPEN|=SET_BIT5
           
